"""
зауважте, що значення, що зберігається в кожному елементі - теж словник, і доступ до вкладеного списку 
здійснюється за механізмом 
student[outer_dict_key][inner_dict_key]

Є дані студентів (комбінація імені та прізвища унікальна), що зберігаються за допомогою словника
1 - програмно добавити одного студента, з заповненням усіх полів (вік - від 18 до 40, цілочисельне значення, 
    бал від 0 до 100 (інт чи флоат)
2 - створити і вивести на екран список студентів (імя та прізвище та середній бал), у яких середній бал більше 90
    сам формат наповнення цього списку up to you
3 - визначити середній бал по групі
4 - при відсутності номеру телефону у студента записати номер батьків (номер на ваш вибір)

не забувайте виводити інформаційні повідомлення щодо інформації, яку ви виводите
"""
students = {
    'Іван Петров': {
        'Пошта': 'Ivan@gmail.com',
        'Вік': 14,
        'Номер телефону': '+380987771221',
        'Середній бал': 95.8
    },
    'Женя Курич': {
        'Пошта': 'Geka@gmail.com',
        'Вік': 16,
        'Номер телефону': None,
        'Середній бал': 64.5
    },
    'Маша Кера': {
        'Пошта': 'Masha@gmail.com',
        'Вік': 18,
        'Номер телефону': '+380986671221',
        'Середній бал': 80
    },
}
# ваш код нижче !!!!!!!! вище нічого не змінюємо


students['Олександр Добринькін'] = {
    'Пошта': 'Sasha@gmail.com',
    'Вік': 20,
    'Номер телефону': '+380933503792',
    'Середній бал': 91
}
print('Додано нового студента')
print('Олександр Добринькін')
print(students['Олександр Добринькін'])


high_score_students = []
for student_name, student_info in students.items():
    if student_info['Середній бал'] > 90:
        high_score_students.append([student_name, student_info['Середній бал'], student_info['Пошта']])
print('Список відмінників')
for student in high_score_students:
    print(student)


scores = [student_info['Середній бал'] for student_info in students.values()]
print(f'Середній бал групи: {sum(scores)/len(scores)}')


for student_name, student_info in students.items():
    if not student_info['Номер телефону']:
        students[student_name]['Номер телефону'] = '+380933539659'
        print(f'Студенту {student_name} додано номер телефону')
        print(students[student_name])
